//===========================================
//
// ネズミの幽霊の処理[rat_ghost.cpp]
// Author 佐藤根詩音
//
//===========================================
//*******************************************
// インクルードファイル
//*******************************************
#include "main.h"
#include "manager.h"
#include "rat_ghost.h"
#include "rat.h"
#include "objectX.h"

//-------------------------------------------
// マクロ定義
//-------------------------------------------

//-------------------------------------------
// 静的メンバ変数宣言
//-------------------------------------------

//==============================
// コンストラクタ
//==============================
CRatGhost::CRatGhost() : CModel(CObject::TYPE_PLAYER, CObject::PRIORITY_PLAYER)
{
	// 全ての値をクリアする
}

//==============================
// デストラクタ
//==============================
CRatGhost::~CRatGhost()
{

}

//==============================
// 破片の初期化処理
//==============================
HRESULT CRatGhost::Init(void)
{
	if (FAILED(CModel::Init()))
	{ // 初期化処理に失敗した場合

		// 失敗を返す
		return E_FAIL;
	}

	// 全ての値を初期化する

	// 値を返す
	return S_OK;
}

//========================================
// 破片の終了処理
//========================================
void CRatGhost::Uninit(void)
{
	// 終了処理
	CModel::Uninit();
}

//=====================================
// 破片の更新処理
//=====================================
void CRatGhost::Update(void)
{

}

//=====================================
// 破片の描画処理
//=====================================
void CRatGhost::Draw(void)
{
	// 描画処理
	CModel::Draw();
}

//=====================================
// 情報の設定処理
//=====================================
void CRatGhost::SetData(const D3DXVECTOR3& pos)
{
	// 設定処理に便利なマクロ定義
	//NONE_D3DXVECTOR3					// 向きを傾けない時とかに使用する
	//NONE_SCALE						// 拡大率を変更しないときとかに使う
	// 情報の設定処理

	//==========================================================================
	// 2Dポリゴン
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetRot(向きを入れる);			// 向き
	//SetSize(サイズを入れる);		// サイズ
	//SetLength(引数無し);			// 長さ
	//SetAngle(引数無し);			// 方向
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	//// 頂点座標の設定処理
	//SetVertex();

	//==========================================================================
	// 3Dポリゴン
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetRot(向きを入れる);			// 向き
	//SetSize(サイズを入れる);		// サイズ
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	//// 頂点座標の設定処理
	//SetVertex();

	//==========================================================================
	// ビルボード
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetSize(サイズを入れる);		// サイズ
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	//// 頂点座標の設定処理
	//SetVertex();

	//==========================================================================
	// アニメーション系
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetRot(向きを入れる);			// 向き
	//SetSize(サイズを入れる);		// サイズ
	//SetLength(引数無し);			// 長さ
	//SetAngle(引数無し);			// 方向
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	// アニメーションの設定処理
	//SetAnim(カウントを入れる, パターン数を入れる);

	//// 頂点座標の設定処理
	//SetVertex();

	// テクスチャの設定(アニメーションバージョン)
	//SetVtxTextureAnim(アニメーションの総パターン数を入れる, 0);

	//==========================================================================
	// モデル
	//==========================================================================
	SetPos(pos);			// 位置
	SetPosOld(GetPos());							// 前回の位置
	SetRot(D3DXVECTOR3(0.0f, 0.0f, 0.0f));			// 向き
	SetScale(NONE_SCALE);							// 拡大率
	SetFileData(CXFile::TYPE_RAT_GHOST);			// モデルの情報
}

//=======================================
// 生成処理
//=======================================
CRatGhost* CRatGhost::Create(const D3DXVECTOR3& pos)
{
	// ローカルオブジェクトを生成
	CRatGhost* pRatGhost = nullptr;	// サンプルのインスタンスを生成

	if (pRatGhost == nullptr)
	{ // オブジェクトが NULL の場合

		// インスタンスを生成
		pRatGhost = new CRatGhost;
	}
	else
	{ // オブジェクトが NULL じゃない場合

		// 停止
		assert(false);

		// NULL を返す
		return nullptr;
	}

	if (pRatGhost != nullptr)
	{ // オブジェクトが NULL じゃない場合

		// 初期化処理
		if (FAILED(pRatGhost->Init()))
		{ // 初期化に失敗した場合

			// 停止
			assert(false);

			// NULL を返す
			return nullptr;
		}

		// 情報の設定処理
		pRatGhost->SetData(pos);
	}
	else
	{ // オブジェクトが NULL の場合

		// 停止
		assert(false);

		// NULL を返す
		return nullptr;
	}

	// サンプルのポインタを返す
	return pRatGhost;
}